Repository: dengxuyue/postgresql
Catalog: ext/postgis/doc/po/*/performance_tips.xml.po
Languages: it_it

source: Performance tips
it_it: Consigli per migliori prestazioni

source: Small tables of large geometries
it_it: Piccole tabelle contenenti geometrie di grandi dimensioni

source: Problem description
it_it: Descrizione del problema

source: Current PostgreSQL versions (including 8.0) suffer from a query optimizer weakness regarding TOAST tables. TOAST tables are a kind of "extension room" used to store large (in the sense of data size) values that do not fit into normal data pages (like long texts, images or complex geometries with lots of vertices), see <ulink url="http://www.postgresql.org/docs/current/static/storage-toast.html">the PostgreSQL Documentation for TOAST</ulink> for more information).
it_it: Le attuali versioni di PostgreSQL (compresa la versione 8.0) sono affette da un difetto del query optimizer riguardante le tabelle TOAST. Le tabelle TOAST sono una sorta di "spazio aggiuntivo" usato per memorizzare valori di grandi dimensioni (nel senso di dimensioni dei dati) che non possono essere salvati in normali pagine (per esempio lunghi testi, immagini o geometrie con molti vertici). Vedi <ulink url="http://www.postgresql.org/docs/current/static/storage-toast.html">la documentazione PostgreSQL sulle tabelle TOAST</ulink> per maggiori informazioni).

source: The problem appears if you happen to have a table with rather large geometries, but not too much rows of them (like a table containing the boundaries of all European countries in high resolution). Then the table itself is small, but it uses lots of TOAST space. In our example case, the table itself had about 80 rows and used only 3 data pages, but the TOAST table used 8225 pages.
it_it: Il problema si presenta nel caso di tabelle contenenti geometrie di grandi dimensioni ma poche righe (per esempio una tabella contenente i confini di tutti gli stati europei ad alta risoluzione). In questo caso infatti la tabella in se è di piccole dimensioni ma usa molto spazio TOAST. Nel nostro esempio la tabella conteneva circa 80 righe e utilizzava solo 3 pagine di dati, ma la tabella TOAST ne utilizzava 8225.

source: Now issue a query where you use the geometry operator &amp;&amp; to search for a bounding box that matches only very few of those rows. Now the query optimizer sees that the table has only 3 pages and 80 rows. He estimates that a sequential scan on such a small table is much faster than using an index. And so he decides to ignore the GIST index. Usually, this estimation is correct. But in our case, the &amp;&amp; operator has to fetch every geometry from disk to compare the bounding boxes, thus reading all TOAST pages, too.
it_it: Ora si lanci una query che usi l'operatore &amp;&amp; e che [MATCHES] solo poche righe. Il

source: To see whether your suffer from this bug, use the "EXPLAIN ANALYZE" postgresql command. For more information and the technical details, you can read the thread on the postgres performance mailing list: http://archives.postgresql.org/pgsql-performance/2005-02/msg00030.php
it_it: Per controllare se i propri dati sono interessati da questo bug, si può usare il comando PostgreSQL "EXPLAIN ANALYZE". Per maggiori informazioni e dettagli tecnici consultare il corrispondente thread sulla mailing list di PostgreSQL: http://archives.postgresql.org/pgsql-performance/2005-02/msg00030.php

source: Workarounds
it_it: Possibili soluzioni

source: The PostgreSQL people are trying to solve this issue by making the query estimation TOAST-aware. For now, here are two workarounds:
it_it: Gli sviluppatori di PostgreSQL stanno cercando di risolvere il problema rendendo la valutazione della query indipendente dalla tabella TOAST. Per ora ci sono due possibili soluzioni alternative:

source: The first workaround is to force the query planner to use the index. Send "SET enable_seqscan TO off;" to the server before issuing the query. This basically forces the query planner to avoid sequential scans whenever possible. So it uses the GIST index as usual. But this flag has to be set on every connection, and it causes the query planner to make misestimations in other cases, so you should "SET enable_seqscan TO on;" after the query.
it_it: La è forzare il query planner ad usare l'indice spaziale usando il comando "SET enable_seqscan TO off;" prima di lanciare la query. Questo comando impedisce al query planner di usare lo scan sequenziale della tabella se possibile e lo forza quindi ad usare l'indice GIST. Tuttavia il comando deve essere lanciato ad ogni connessione e, per evitare di confondere il query planner in altri casi, il parametro deve essere resettato dopo l'esecuzione della query interessata con il comando "SET enable_seqscan TO on;" .

source: The second workaround is to make the sequential scan as fast as the query planner thinks. This can be achieved by creating an additional column that "caches" the bbox, and matching against this. In our example, the commands are like:
it_it: Il secondo metodo è rendere lo scan sequenziale così veloce come il query planner si aspetta che sia. Questo può essere raggiunto aggiungendo una colonna addizionale in cui salvare la bounding box di ogni geometria. Nel nostro esempio i comandi sarebbero:

source: Now change your query to use the &amp;&amp; operator against bbox instead of geom_column, like:
it_it: Ora la query deve essere modificata in modo da usare l'operatore &amp;&amp; con la colonna bbox piuttosto che con la colonna geom_column:

source: Of course, if you change or add rows to mytable, you have to keep the bbox "in sync". The most transparent way to do this would be triggers, but you also can modify your application to keep the bbox column current or run the UPDATE query above after every modification.
it_it: Ovviamente la colonna bbox deve essere mantenuta attuale quando si modificano o si aggiungono geometrie. La via più semplice per fare questo sarebbe con un trigger, oppure l'applicazione può essere modificata in modo da attualizzare anche la colonna bbox oppure si può lanciare l'UPDATE precedente dopo ogni modifica.

source: CLUSTERing on geometry indices
it_it: CLUSTERing di indici geometrici

source: For tables that are mostly read-only, and where a single index is used for the majority of queries, PostgreSQL offers the CLUSTER command. This command physically reorders all the data rows in the same order as the index criteria, yielding two performance advantages: First, for index range scans, the number of seeks on the data table is drastically reduced. Second, if your working set concentrates to some small intervals on the indices, you have a more efficient caching because the data rows are spread along fewer data pages. (Feel invited to read the CLUSTER command documentation from the PostgreSQL manual at this point.)
it_it: Per tabelle che vengono per lo più solo lette, e dove un singolo indice è usato dalla maggior parte delle query, PostgreSQL offre il comando CLUSTER. Questo comando riordina fisicamente le righe in modo che l'ordine corrisponda a quello dell'indice. Con questo metodo si migliorano le prestazioni per due motivi: primo, il numero delle ricerche nella tabella dei dati è ridotto drasticamente. Secondo, se i dati interessati dalla query sono concentrati in un piccolo intervallo sull'indice, il processo di mettere in cache sarà più efficiente perché le righe saranno distribuite all'interno di poche pagine. (si invita a leggere la documentazione di PostgreSQL riguardante il comando CLUSTER).

source: However, currently PostgreSQL does not allow clustering on PostGIS GIST indices because GIST indices simply ignores NULL values, you get an error message like:
it_it: Attualmente però, PostgreSQL non permette di usare il clustering con indici GIST, perché gli indici GIST ignorano i valori nulli:

source: As the HINT message tells you, one can work around this deficiency by adding a "not null" constraint to the table:
it_it: Come suggerito dal messaggio di errore, è possibile aggirare il problema aggiungendo un vincolo "NOT NULL" alla tabella:

source: Of course, this will not work if you in fact need NULL values in your geometry column. Additionally, you must use the above method to add the constraint, using a CHECK constraint like "ALTER TABLE blubb ADD CHECK (geometry is not null);" will not work.
it_it: Ovviamente questo non funzionerà se la colonna the_geom già contiene valori nulli. Inoltre il vincolo dev'essere definito usando il comando precedente. Usare un vincolo CHECK del tipo "ALTER TABLE blubb ADD CHECK (geometry is not null);" non funzionerà.

source: Avoiding dimension conversion
it_it: Evitare la conversione della dimensione

source: Note that if you added your geometry column using AddGeometryColumn() there'll be a constraint on geometry dimension. To bypass it you will need to drop the constraint. Remember to update the entry in the geometry_columns table and recreate the constraint afterwards.
it_it: Se la colonna di tipo geometry è stata aggiunta usando la funzione AddGeometryColumn(), verrà creato anche un vincolo dimensionale sulla geometria. Per aggirare il vincolo sarà necessario cancellarlo. Ricorda di attualizzare il record nella tabella geometry_columns e di ricreare il vincolo successivamente.

source: In case of large tables, it may be wise to divide this UPDATE into smaller portions by constraining the UPDATE to a part of the table via a WHERE clause and your primary key or another feasible criteria, and running a simple "VACUUM;" between your UPDATEs. This drastically reduces the need for temporary disk space. Additionally, if you have mixed dimension geometries, restricting the UPDATE by "WHERE dimension(the_geom)&gt;2" skips re-writing of geometries that already are in 2D.
it_it: Nel caso di grandi tabelle può essere sensato dividere l'UPDATE in porzioni più piccole, usando la clausola WHERE con la chiave primaria o un altro criterio flessibile per attualizzare solo una parte della tabella , ed eseguendo un semplice "VACUUM;" tra gli UPDATE. Questo accorgimento ridurrà drasticamente il bisogno lo spazio temporaneo sul disco. Inoltre, se la colonna geometrica contiene geometrie con diverse dimensioni, si può limitare l'UPDATE con "WHERE dimension(the_geom)&gt;2", evitando così di riscrivere le geometrie che sono già in 2D.

source: Tuning your configuration
it_it: Mettere a punto la configurazione

source: These tips are taken from Kevin Neufeld's presentation "Tips for the PostGIS Power User" at the FOSS4G 2007 conference. Depending on your use of PostGIS (for example, static data and complex analysis vs frequently updated data and lots of users) these changes can provide significant speedups to your queries.
it_it: Questi consigli sono tratti dalla presentazione di Kevin Neufeld "Tips for the PostGIS Power User" alla conferenza FOSS4G 2007. A seconda del contesto in cui viene usato PostGIS (per esempio dati statici e analisi complesse piuttosto che update frequenti e numerosi utenti) questi cambiamenti possono significare un significativo aumento della velocità delle query.

source: For a more tips (and better formatting), the original presentation is at <ulink url="http://2007.foss4g.org/presentations/view.php?abstract_id=117"> http://2007.foss4g.org/presentations/view.php?abstract_id=117</ulink>.
it_it: Per più consigli (e una formattazione migliore) la presentazione originale è consultabile a <ulink url="http://2007.foss4g.org/presentations/view.php?abstract_id=117"> http://2007.foss4g.org/presentations/view.php?abstract_id=117</ulink>.

source: These settings are configured in postgresql.conf:
it_it: Queste impostazioni sono definite in postgresql.conf:

source: Maximum number of log file segments between automatic WAL checkpoints (each segment is normally 16MB); default is 3
it_it: Numero massimo di segmenti del log file tra checkpoint WAL (ogni segmento è normalmente 16MB); l'impostazione predefinita è 3.

source: Set to at least 10 or 30 for databases with heavy write activity, or more for large database loads. Another article on the topic worth reading <ulink url="http://www.westnet.com/~gsmith/content/postgresql/chkp-bgw-83.htm">Greg Smith: Checkpoint and Background writer</ulink>
it_it: Impostare almeno su 10 o 30 per database con intensa attività di scrittura, o più quando si importa nel database grandi quantità di dati. Un altro articolo da leggere sull'argomento è <ulink url="http://www.westnet.com/~gsmith/content/postgresql/chkp-bgw-83.htm">Greg Smith: Checkpoint and Background writer</ulink>

source: Possibly store the xlog on a separate disk device
it_it: Se possibile, salvare il xlog su un disco separato

source: Default: off (prior to PostgreSQL 8.4 and for PostgreSQL 8.4+ is set to partition)
it_it: Il valore di default è "off" per versioni inferiori alla 8.4 e "partition" a partire dalla 8.4()

source: This is generally used for table partitioning. If you are running PostgreSQL versions below 8.4, set to "on" to ensure the query planner will optimize as desired. As of PostgreSQL 8.4, the default for this is set to "partition" which is ideal for PostgreSQL 8.4 and above since it will force the planner to only analyze tables for constraint consideration if they are in an inherited hierarchy and not pay the planner penalty otherwise.
it_it: Generalmente usato per il partizionamento delle tabelle. Con versioni di PostgreSQL inferiori alla 8.4 impostare il parametro su "on" per permettere al query planner di ottimizzare secondo necessità. Da PostgreSQL 8.4, il valore di default è "partition", ideale per versioni 8.4 e superiori perché forza il query planner ad analizzare i vincoli delle tabelle solo se queste sono in una gerarchia di ereditarietà e non essere penalizzate dal planner in caso contrario.

source: Set to about 1/3 to 3/4 of available RAM
it_it: Impostare da 1/3 a 3/4 della RAM disponibile.

source: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-WORK-MEM">work_mem</ulink> (the memory used for sort operations and complex queries)
it_it: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-WORK-MEM">work_mem</ulink> (memoria usata per operazioni di ordinamento e query complesse)

source: Adjust up for large dbs, complex queries, lots of RAM
it_it: Aumentare il valore per grandi database, query complesse, abbondanza di RAM

source: Adjust down for many concurrent users or low RAM.
it_it: Diminuire il valore nel caso di molti utenti concorrenti oppure disponibilità di RAM ridotta

source: If you have lots of RAM and few developers:
it_it: Nel caso di molta RAM e pochi programmatori:

source: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAINTENANCE-WORK-MEM">maintenance_work_mem</ulink> (used for VACUUM, CREATE INDEX, etc.)
it_it: <ulink url="http://www.postgresql.org/docs/current/static/runtime-config-resource.html#GUC-MAINTENANCE-WORK-MEM">maintenance_work_mem</ulink> (usato per VACUUM, CREATE INDEX, etc.)

source: Generally too low - ties up I/O, locks objects while swapping memory
it_it: Generalmente troppo basso. Tiene occupati i processi Input/Output e blocca oggetti quando viene impegnata la memoria swap.

source: Recommend 32MB to 256MB on production servers w/lots of RAM, but depends on the # of concurrent users. If you have lots of RAM and few developers:
it_it: Si raccomandano 32MB oppure 256MB su server di produzione con molta RAM, ma dipende dal numero di utenti concorrenti. Nel caso di molta RAM e pochi sviluppatori:
