Repository: dengxuyue/postgresql
Catalog: ext/postgis/doc/po/*/reference_transaction.xml.po
Languages: es

source: Long Transactions Support
es: Soporte para transacciones grandes

source: This module and associated pl/pgsql functions have been implemented to provide long locking support required by <ulink url="http://www.opengeospatial.org/standards/wfs">Web Feature Service</ulink> specification.
es: Este módulo y las funciones asociadas pl/pgsql se han implementado para proporcionar soporte a bloqueos extensos que son requeridos por la especificación <ulink url="http://www.opengeospatial.org/standards/wfs">Web Feature Service</ulink>

source: Users must use <ulink url="http://www.postgresql.org/docs/current/static/transaction-iso.html">serializable transaction level</ulink> otherwise locking mechanism would break.
es: Los usuarios deben usar <ulink url="http://www.postgresql.org/docs/current/static/transaction-iso.html">el nivel de transacción en serie</ulink> sino se rompería el mecanismo de bloqueo.

source: <refpurpose>Add an authorization token to be used in current transaction.</refpurpose>
es: <refpurpose>Agrega un testigo de autorización para usarlo en la transacción actual.</refpurpose>

source: Description
es: Descripción

source: <para>Add an authorization token to be used in current transaction.</para>
es: <para>Agrega un testigo de autorización para usarlo en la transacción actual.</para>

source: Creates/adds to a temp table called temp_lock_have_table the current transaction identifier and authorization token key.
es: Crea/agrega a una tabla temporal llamada temp_lock_have_table el identificador de la transacción actual y la clave del testigo de autorización.

source: Availability: 1.1.3
es: Disponibilidad: 1.1.3

source: Examples
es: Ejemplos

source: SELECT LockRow('towns', '353', 'priscilla'); BEGIN TRANSACTION; SELECT AddAuth('joey'); UPDATE towns SET the_geom = ST_Translate(the_geom,2,2) WHERE gid = 353; COMMIT; ---Error-- ERROR: UPDATE where "gid" = '353' requires authorization 'priscilla'
es: SELECT LockRow('towns', '353', 'priscilla'); BEGIN TRANSACTION; SELECT AddAuth('joey'); UPDATE towns SET the_geom = ST_Translate(the_geom,2,2) WHERE gid = 353; COMMIT; ---Error-- ERROR: UPDATE where "gid" = '353' requiere la autorización 'priscilla'

source: See Also
es: Ver también

source: Creates trigger on a table to prevent/allow updates and deletes of rows based on authorization token.
es: Crea un disparador sobre una tabla para prevenir/permitir actualizaciones y borrados de filas basados en el testigo de autorización.

source: Creates trigger on a table to prevent/allow updates and deletes of rows based on authorization token. Identify rows using &lt;rowid_col&gt; column.
es: Crea un disparador sobre una tabla para prevenir/permitir actualizaciones y borrado de filas basado en el testigo de autorizaciones. Identifica filas usando la columna &lt;rowid_col&gt; .

source: If a_schema_name is not passed in, then searches for table in current schema.
es: Si no se le pasa un nombre de esquema, a_schema_name, busca la tabla en el esquema actual.

source: If an authorization trigger already exists on this table function errors.
es: Si ya existe un disparador de autorización sobre esta tabla la función da error.

source: If Transaction support is not enabled, function throws an exception.
es: Si no está habilitado el soporte de transacciones, la función lanza una excepción.

source: <refpurpose>Disable long transaction support. This function removes the long transaction support metadata tables, and drops all triggers attached to lock-checked tables.</refpurpose>
es: <refpurpose>Deshabilita el soporte de transacciones grandes. Esta función elimina las tablas de metadatos para soporte de transacciones grandes, y borra todos los disparadores vinculados a las tablas de comprobación de bloqueos.</refpurpose>

source: <para>Disable long transaction support. This function removes the long transaction support metadata tables, and drops all triggers attached to lock-checked tables.</para>
es: <para>Deshabilita el soporte de transacciones grandes. Esta función elimina las tablas de metadatos para soporte de transacciones grandes, y borra todos los disparadores vinculados a las tablas de comprobación de bloqueos.</para>

source: Drops meta table called <varname>authorization_table</varname> and a view called <varname>authorized_tables</varname> and all triggers called <varname>checkauthtrigger</varname>
es: Elimina la meta tabla llamada <varname>authorization_table</varname> y una vista llamada <varname>authorized_tables</varname> y todos los disparadores llamados <varname>checkauthtrigger</varname>

source: SELECT DisableLongTransactions(); --result-- Long transactions support disabled
es: SELECT DisableLongTransactions(); --result-- Soporte de transacciones grandes deshabilitado

source: <refpurpose>Enable long transaction support. This function creates the required metadata tables, needs to be called once before using the other functions in this section. Calling it twice is harmless.</refpurpose>
es: <refpurpose>Habilita el soporte de transacciones grandes. Esta función crea las tablas de metadatos requeridas, necesita ser llamada una vez antes de usar las otras funciones en esta sección. Llamarla más de una vez no produce problemas.</refpurpose>

source: <para>Enable long transaction support. This function creates the required metadata tables, needs to be called once before using the other functions in this section. Calling it twice is harmless.</para>
es: <para>Habilita el soporte de transacciones grandes. Esta función crea las tablas de metadatos requeridas, necesita ser llamada una vez antes de usar las otras funciones en esta sección. Llamarla más de una vez no produce problemas.</para>

source: Creates a meta table called <varname>authorization_table</varname> and a view called <varname>authorized_tables</varname>
es: Crea una meta tabla llamada <varname>authorization_table</varname> y una vista llamada <varname>authorized_tables</varname>

source: SELECT EnableLongTransactions(); --result-- Long transactions support enabled
es: SELECT EnableLongTransactions(); --result-- Soporte para transacciones grandes habilitado

source: Set lock/authorization for specific row in table
es: Configura el bloqueo/autorización para una fila específica de la tabla

source: Set lock/authorization for specific row in table &lt;authid&gt; is a text value, &lt;expires&gt; is a timestamp defaulting to now()+1hour. Returns 1 if lock has been assigned, 0 otherwise (already locked by other auth)
es: Configura el bloqueo/autorización para una fila específica de la tabla &lt;authid&gt; es un valor de texto, &lt;expires&gt; es un valor de tiempo que por defecto es now()+1hora. Devuelve 1 si se asignó el bloqueo, 0 en otro caso (ya bloqueado por otra autorización)

source: SELECT LockRow('public', 'towns', '2', 'joey'); LockRow ------- 1 --Joey has already locked the record and Priscilla is out of luck SELECT LockRow('public', 'towns', '2', 'priscilla'); LockRow ------- 0
es: SELECT LockRow('public', 'towns', '2', 'joey'); LockRow ------- 1 --Joey ya ha bloqueado el registro y Priscilla no tiene suerte SELECT LockRow('public', 'towns', '2', 'priscilla'); LockRow ------- 0

source: <refpurpose>Remove all locks held by specified authorization id. Returns the number of locks released.</refpurpose>
es: <refpurpose>Retira todos los bloqueos mantenidos por el id de la autorización especificada. Devuelve el número de bloqueos liberados.</refpurpose>

source: <para>Remove all locks held by specified authorization id. Returns the number of locks released.</para>
es: <para>Retira todos los bloqueos mantenidos por el id de la autorización especificada. Devuelve el número de bloqueos liberados.</para>
